Repository: bisslee/Hapvida-test-dotnet
Catalog: Hapvida.ExternalIntegration/src/Hapvida.ExternalIntegration.Domain/Resources/HapvidaExternalIntegrationResource.*.resx
Languages: es

# ZipCode_Empty
source: ZIP code cannot be empty.
es: El código postal no puede estar vacío.

# ZipCode_InvalidCharacters
source: ZIP code must contain only digits.
es: El código postal debe contener solo dígitos.

# ZipCode_InvalidLength
source: ZIP code must contain exactly {0} digits.
es: El código postal debe contener exactamente {0} dígitos.

# Cep_InvalidFormat
source: ZIP code must contain 8 digits. Received value: {0}
es: El código postal debe contener 8 dígitos. Valor recibido: {0}

# Cep_NotFound
source: ZIP code {0} was not found in any provider.
es: El código postal {0} no fue encontrado en ningún proveedor.

# Cep_InvalidTitle
source: Invalid ZIP code
es: Código postal inválido

# Cep_NotFoundTitle
source: ZIP code not found
es: Código postal no encontrado

# Provider_BrasilApiNotFound
source: BrasilAPI provider not found
es: Proveedor BrasilAPI no encontrado

# Provider_ViaCepNotFound
source: ViaCEP provider not found
es: Proveedor ViaCEP no encontrado

# REQUIRED_ZIPCODE
source: ZIP code is required!
es: ¡El código postal es obligatorio!

# INVALID_ZIPCODE
source: Invalid ZIP code. Must contain 8 digits.
es: Código postal inválido. Debe contener 8 dígitos.
